/* Copyright © 2001-2012 Apple Inc. All Rights Reserved. */
/* Localization dictionary for Apple Hardware Test 3.0 series */

"is-two-bytes"	= "0";
"version-sig"	= "EN-070918";

"common-controls-restart"		= "Reštartovať";
"common-controls-shutdown"		= "Vypnúť";
"common-controls-continue"		= "Pokračovať";

"common-tab-apple-title"		= " Informácie ";			// does look better with spaces at head and tail
"common-tab-test-title"			= " Hardvérové testy ";	// does look better with spaces at head and tail
"common-tab-profile-title"		= " Profil hardvéru ";	// does look better with spaces at head and tail
"common-version-str"			= "Verzia ";
"common-bundle-str"				= "Balík ";

"mark-graphics-unknown-str"		= "Neznáme video";
"mark-graphics-none-str"		= " ";

"mark-generic-present-str"		= "Nainštalované";
"mark-generic-absent-str"		= "Not Found";
"mark-generic-hasDevice-str"	= "Pripojené zariadenie";
"mark-generic-hasNoDevice-str"	= "Žiadne pripojené zariadenia";

"units-hz--short-str"	= "Hz";
"units-hz--long-str"	= "Hz";
"units-byte-short-str"	= "B";
"units-byte-long-str"	= "Bajt";
"units-bit-short-str"	= "b";
"units-bit-long-str"	= "bit";
"units-volt-short-str"	= "V";
"units-volt-long-str"	= "Volt";


"units-hour-str"		= " h";
"units-hours-str"		= " h";
"units-min-str"			= " min";
"units-mins-str"		= " min";
"units-sec-str"			= " s";
"units-secs-str"		= " s";

"units-kilo-str"		= "K";
"units-mega-str"		= "M";
"units-giga-str"		= "G";
"units-tera-str"		= "T";

"delim-date-str"		= "/";
"delim-at-str"			= " @ ";
"delim-record-str"		= ":";
"delim-field-str"		= ", ";
"delim-item-str"		= "-";
"delim-decimal-str"		= ".";
"delim-thousds-str"		= ", ";
"delim-space-str"		= " ";
"delim-pct-str"			= "%";

"notcompat-nosupport-str"		= "Hardvérový test Apple nepodporuje tento počítač.";
"notcompat-ownrisk-str"			= "Pokračujte na vlastné riziko [len neoficiálna verzia].";


"test-head-intro1-text"			= "Hardvérový test Apple môže otestovať hardvér vášho Macintosha.";
"test-head-intro2-text"			= "Ak chcete spustiť test, kliknite na tlačidlo „Otestovať“ alebo stlačte kláves „T“.";

"test-probe-onto-text"			= "Váš hardvér sa sonduje. To môže chvíľu trvať…";
"test-probe-outof-text"			= "Sondovanie hardvéru dokončené.";

"test-controls-launch"			= "Otestovať";
"test-controls-interrupt"		= "Zastaviť testovanie";

"test-choices-title"			= "Výber testu";
"test-about-title"				= "O testovaní a výsledkoch";
"test-results-title"			= "Výsledky testovania";

"test-results-notestyet"		= "Testovanie nie je možné spustiť pred dokončením sondovania.";
"test-results-nodevfound"		= "Nenašli sa žiadne zariadenia.";
"test-results-notyet"			= "Pripravené na testovanie.";
"test-results-quick-ongoing"	= "Prebieha testovanie.";
"test-results-extend-ongoing"	= "Prebieha rozšírené testovanie.";
"test-results-willstop"			= "Testovanie bude zastavené.";
"test-results-interrupted"		= "Testovanie nebolo dokončené.";
"test-results-nofail"			= "Nenašli sa žiadne problémy.";
"test-results-error"			= "Počas testu sa vyskytla interná chyba.";
"test-results-failed"			= "Pozor!  Hardvérový test Apple zistil chybu.";

"test-ongoing-short-status"		= "Prebieha testovanie.";
"test-ongoing-mlb-status"		= "Testuje sa základná doska.";
"test-ongoing-memory-status"	= "Testuje sa pamäť.";
"test-ongoing-storage-status"	= "Testuje sa úložisko.";
"test-ongoing-video-status"		= "Testuje sa grafika.";

"test-ongoing-pass-time-text"	= " do testovania…";
"test-ongoing-pass-time-1-text"	= " ";
"test-ongoing-pass-time-2-text"	= "do testovania…";
"test-ongoing-sess-pass-text"	= "Počet vyhovujúcich: ";
"test-ongoing-sess-time-text"	= "Celkový čas testovania: ";

"test-desc-initial-1-text"	= "Hardvérový test Apple je diagnostický nástroj určený na zisťovanie problémov s hardvérovými komponentami počítača.";
"test-desc-initial-2-text"	= " ";
"test-desc-initial-3-text"	= "Vykonané testy vám pomôžu stanoviť, či sa jedná o hardvérový alebo softvérový problém.";
"test-desc-initial-4-text"	= " ";
"test-desc-initial-5-text"	= "Ak sa podľa výsledkov testovania nejedná o hardvérový problém, vyhľadajte riešenie problému v manuály a/alebo Pomocníkovy (v systéme), ktorý bol dodaný k vášmu počítaču.";
"test-desc-initial-6-text"	= " ";

"test-desc-intro-quick-text"	= "Odhadovaný čas dokončenia: 3 a viac minút, v závislosti od množstva nainštalovanej pamäte.";	/* default */
"test-desc-intro-quick-text2"	= "Odhadovaný čas dokončenia: 10 až 15 sekúnd, v závislosti od množstva nainštalovanej pamäte.";
"test-desc-intro-quick-text3"	= "Odhadovaný čas dokončenia: 2 a viac minút, v závislosti od množstva nainštalovanej pamäte.";
"test-desc-intro-quick-text4"	= "Odhadovaný čas dokončenia: 4 a viac minút, v závislosti od množstva nainštalovanej pamäte.";

"test-desc-intro-extend-text"	= "Odhadovaný čas dokončenia: 1 a viac hodín, v závislosti od množstva nainštalovanej pamäte.";	/* default */
"test-desc-intro-extend-text2"	= "Odhadovaný čas dokončenia: 10 až 15 minút, v závislosti od množstva nainštalovanej pamäte.";
"test-desc-intro-extend-text3"	= "Odhadovaný čas dokončenia: 30 a viac minút, v závislosti od množstva nainštalovanej pamäte.";
"test-desc-intro-extend-text4"	= "Odhadovaný čas dokončenia: 2 a viac hodín, v závislosti od množstva nainštalovanej pamäte.";

"test-desc-option-extend-text"	= "Vykonať rozšírené testovanie (zaberie podstatne viac času).";
"test-desc-option-loop-text"	= "Slučka povolená.";

"test-desc-quick-running-1-text"	= "Prebieha testovanie...";
"test-desc-quick-running-2-text"	= "Testovanie zastavíte stlačením tlačidla „Zastaviť testovanie“.";
"test-desc-quick-running-3-text"	= "Prípadne naraz stlačte klávesy „command“ („Apple“) a „ .“ (bodka).";
"test-desc-quick-running-4-text"	= " ";

"test-desc-extend-running-1-text"	= "Prebieha rozšírené testovanie...";
"test-desc-extend-running-2-text"	= "Testovanie zastavíte stlačením tlačidla „Zastaviť testovanie“.";
"test-desc-extend-running-3-text"	= "Prípadne naraz stlačte klávesy „command“ („Apple“) a „ .“ (bodka).";
"test-desc-extend-running-4-text"	= " ";

/* About the Tests and Results Test tests failed */
"test-result-testing-1-text"		= "Pozor!  Hardvérový test Apple zistil chybu.";
"test-result-testing-2-text"		= " ";
"test-result-testing-3-text"		= "Najprv si poznačte kód chyby v časti výsledky testovania.";
"test-result-testing-4-text"		= " ";
"test-result-testing-5-text"		= "Potom, ak sú k počítaču pripojené periférne zariadenia, vypnite ho, odpojte periférne zariadenia a spustite kvôli overeniu výsledkov Rozšírené testovanie.";
"test-result-testing-6-text"		= " ";
"test-result-testing-7-text"		= "Ak testovanie aj naďalej hlási chybu, vyhľadajte v materiáloch dodaných k svojmu počítaču inštrukcie týkajúce sa kontaktovania služby AppleCare.";
"test-result-testing-8-text"		= " ";

/* About the Tests and Results Test POST failed */
"test-result-startup-1-text"		= "Pozor!  Hardvérový test Apple zistil chybu pri spúšťaní.";
"test-result-startup-2-text"		= " ";
"test-result-startup-3-text"		= "Najprv si poznačte kódy chýb v časti výsledky testovania.";
"test-result-startup-4-text"		= " ";
"test-result-startup-5-text"		= "Potom, ak sú k počítaču pripojené periférne zariadenia, vypnite ho, odpojte periférne zariadenia a spustite kvôli overeniu výsledkov Rozšírené testovanie.";
"test-result-startup-6-text"		= " ";
"test-result-startup-7-text"		= "Ak testovanie aj naďalej hlási chybu, vyhľadajte v materiáloch dodaných k svojmu počítaču inštrukcie týkajúce sa kontaktovania služby AppleCare.";
"test-result-startup-8-text"		= " ";
"test-result-startup-9-text"		= " ";
"test-result-startup-10-text"		= " ";
"test-result-startup-11-text"		= " ";


/* HW-Profile values */

"prof-prod-group-title"			= "Produkt";
"prof-prod-group-subtitle"		= "Detaily produktu:";
"prof-prod-name-label"			= "Názov Macintosha:";
"prof-prod-model-label"			= "Model Macintosha:";
"prof-prod-cputype-label"		= "Typ CPU:";
"prof-prod-cpucount-label"		= "Počet procesorov:";
"prof-prod-cpucoretotal-label"	= "Celkový počet jadier:";
"prof-prod-cpucorecount-label"	= "Počet jadier:";
"prof-prod-cpuspeed-label"		= "Rýchlosť CPU:";
"prof-prod-cpucache-label"		= "L2 CPU Cache (na procesor)";

"prof-prod-L2cache-label"		= "L2 Cache:";
"prof-prod-L2cachecore-label"	= "L2 Cache (na jadro):";
"prof-prod-L3cache-label"		= "L3 Cache:";

"prof-prod-cpucache3-label"		= "L3 CPU Cache (na CPU):";
"prof-prod-mlb-sn-label"		= "Sériové č. MLB:";
"prof-processor-tray-sn-label"	= "Sériové č. procesorovej karty:";

"prof-graph-group-title"		= "Video";
"prof-graph-group-subtitle"		= "Detaily videa:";
"prof-graph-chipset-label"		= "Grafika:";
"prof-graph-vram-label"			= "VRAM:";
"prof-graph-disp-width-label"	= "Šírka displeja (v pixloch):";
"prof-graph-disp-height-label"	= "Výška displeja (v pixloch):";

"prof-communi-group-title"		= "Komunikácia";
"prof-communi-group-subtitle"	= "Detaily komunikácie:";
"prof-communi-enet-mac-label"	= "MAC adresa ethernetu:";
"prof-communi-fwire-mac-label"	= "MAC adresa FireWire:";
"prof-communi-airp-type-label"	= "AirPort:";
"prof-communi-bluetooth-label"	= "Bluetooth:";
"prof-communi-irport-label"		= "IR prijímač:";
"prof-communi-usb1-connect-label"	= "USB Port 1:";
"prof-communi-usb2-connect-label"	= "USB port 2:";
"prof-communi-usb3-connect-label"	= "USB port 3:";
"prof-communi-usb4-connect-label"	= "USB port 4:";

"prof-memo-group-title"			= "Pamäť";
"prof-memo-group-subtitle"		= "Detaily pamäte:";
"prof-memo-overview-label"		= "Prehľad";
"prof-memo-slot-1-label"		= "Pamäť č. 1";
"prof-memo-slot-2-label"		= "Pamäť č. 2";
"prof-memo-slot-3-label"		= "Pamäť č. 3";
"prof-memo-slot-4-label"		= "Pamäť č. 4";
"prof-memo-slot-5-label"		= "Pamäť č. 5";
"prof-memo-slot-6-label"		= "Pamäť č. 6";
"prof-memo-slot-7-label"		= "Pamäť č. 7";
"prof-memo-slot-8-label"		= "Pamäť č. 8";

"prof-memo-type-str"			= "MLB vstavaná SDRAM.";
"prof-memo--str"				= "Neznáme";
"prof-memo-pc2-3700-str"		= "PC2-3700";
"prof-memo-pc2-4000-str"		= "PC2-4000";
"prof-memo-pc2-4200-str"		= "PC2-4200";
"prof-memo-pc2-4800-str"		= "PC2-4800";
"prof-memo-ddr2-str"			= "DDR2 SDRAM";
"prof-memo-fbdimm-str"			= "FBDIMM";
"prof-memo-cl-str"				= "CL";
"prof-memo-ct1-str"				= " Čas cyklu (ns)";
"prof-memo-ct2-str"				= " Cyklus (ns)";
"prof-memo-ct3-str"				= " (ns)";
"prof-memo-rev-str"				= "Rev.";
"prof-memo-paired-str"			= "Párované s č. ";
"prof-memo-paired-not-str"		= " nespárované";
"prof-memo-mismatch-label"		= "Nezhoda:";
"prof-memo-size-str"			= " veľkosť";
"prof-memo-speed-str"			= " rýchlosť";
"prof-memo-vendor-str"			= " predajca";
"prof-memo-recommend-str"		= "Odporúčané: ";
"prof-memo-post-fail-str"		= "Zlyhanie POST";

"prof-board-group-title"		= "Základná doska";
"prof-board-brom-vers-label"	= "Verzia Boot ROM:";
"prof-board-smc-vers-label"		= "Verzia SMC:";
"prof-board-syst-sn-label"		= "Sériové č. systému:";
"prof-board-bootdev-label"		= "Predvolené štartovacie zariadenie:";

"prof-stor-group-title"			= "Úložisko";
"prof-stor-size-label"			= "Veľkosť:";

"prof-powr-group-title"			= "Napájanie";
"prof-powr-group-subtitle"		= "Detaily napájania:";
"prof-powr-src-label"			= "Zdroj napájania:";
"prof-powr-src-wall-str"		= "Adaptér";
"prof-powr-src-batt-str"		= "Batéria";
"prof-powr-ac-on-str"			= "Pripojené";
"prof-powr-ac-off-str"			= "Nepripojené";
"prof-powr-capac-label"			= "Kapacita:";
"prof-powr-volt-label"			= "Napätie:";
"prof-powr-status-label"		= "Stav:";

